---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetDiffuseColor(Autodesk.Revit.DB.Color)
source: html/7302a193-6396-93a7-a36e-0bde4f2a119c.htm
---
# Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetDiffuseColor Method

Sets the diffuse color parameter of the effect instance.

## Syntax (C#)
```csharp
public void SetDiffuseColor(
	Color color
)
```

## Parameters
- **color** (`Autodesk.Revit.DB.Color`) - The diffuse color value.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null